Gregification/BeeMS/VT_MSPM0G3507_A/src/Tasks/examples/example_BQ796x2_PROTOCOL_V.cpp
    // -----------------------------------------------------------------------------

    const BQ769X2_PROTOCOL::CmdDrt cmds[] = {
             BQ769X2_PROTOCOL::CmdDrt::Cell1Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell2Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell3Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell4Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell5Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell6Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell7Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell8Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell9Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell10Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell12Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell13Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell14Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell15Voltage,
//             BQ769X2_PROTOCOL::CmdDrt::Cell16Voltage
        };

//    while(1)
//    {
//        uint16_t v = 0xBEEF;
//
//        // dump battery status
//        bool success = bq.I2C_ReadReg(BQ769X2_PROTOCOL::CmdDrt::BatteryStatus, &v, sizeof(v));
//        System::uart_ui.nputs(ARRANDN(success ? CLIGOOD : CLIBAD));
//        printBattStatus(v);
//        System::uart_ui.nputs(ARRANDN(CLIRESET));
//
//        vTaskDelay(pdMS_TO_TICKS(5e3));
//        System::uart_ui.nputs(ARRANDN(NEWLINE NEWLINE NEWLINE));
//    }


    while(true){
        for(uint8_t i = 0; i < sizeof(cmds); i++){
            uint16_t v = 0xBEEF;
            bool success = bq.I2C_ReadReg(cmds[i], &v, sizeof(v));

            snprintf(ARRANDN(str), "%6d,", v);

            System::uart_ui.nputs(ARRANDN(success ? CLIGOOD : CLIBAD));
            System::uart_ui.nputs(ARRANDN(str));
            System::uart_ui.nputs(ARRANDN(CLIRESET));

            vTaskDelay(pdMS_TO_TICKS(1e3));
        }
        System::uart_ui.nputs(ARRANDN(NEWLINE));
    }

    System::uart_ui.nputs(ARRANDN("BQ769x2_PROTOCOL_Test_V_Task End" NEWLINE));
    vTaskDelete(NULL);
}
#else
void Task::BQ769x2_PROTOCOL_Test_V_Task(void*){
    vTaskDelete(NULL);
};
#endif

void printBattStatus(uint16_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printBattStatus: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%04x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET "CFG_UPDATE mode ? "));
    if((v & BV(0)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"PCHG_UPDATE mode ? "));
    if((v & BV(1)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"SLEEP_en ? "));
    if((v & BV(2)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"POR ? "));
    System::uart_ui.nputs(ARRANDN((v & BV(3)) ? "1" : "0"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"WD : "));
    if((v & BV(4)))    System::uart_ui.nputs(ARRANDN("previous reset caused by WD"));
    else               System::uart_ui.nputs(ARRANDN("previous reset normal"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"COW_CHK (Cell Open Wire Check active)? "));
    if((v & BV(5)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"OTPW (OTP write pending)? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"OTPB (OTP write blocked)? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    // SEC bits (9:8)
    uint8_t sec = (v >> 8) & 0x03;
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Security mode: "));
    switch (sec) {
        case 0:
            System::uart_ui.nputs(ARRANDN("Not initialized"));
            break;
        case 1:
            System::uart_ui.nputs(ARRANDN("FULLACCESS"));
            break;
        case 2:
            System::uart_ui.nputs(ARRANDN("UNSEALED"));
            break;
        case 3:
            System::uart_ui.nputs(ARRANDN("SEALED"));
            break;
    }

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"FUSE pin asserted? "));
    if((v & BV(10)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Safety fault (SS)? "));
    if((v & BV(11)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Permanent Fail (PF)? "));
    if((v & BV(12)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "none"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Shutdown pending (SDM)? "));
    if((v & BV(13)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Reserved bit (14): "));
    System::uart_ui.nputs(ARRANDN((v & BV(14)) ? "1" : "0"));

    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Device in SLEEP mode? "));
    if((v & BV(15)))    System::uart_ui.nputs(ARRANDN(CLIYES "yes"));
    else                System::uart_ui.nputs(ARRANDN(CLINO "no"));

    System::uart_ui.nputs(ARRANDN(NEWLINE));
}

void printSafteyStatusA(uint8_t v) {
    System::uart_ui.nputs(ARRANDN(NEWLINE "printSafteyStatusA: "));
    {
        char str[10];
        snprintf(ARRANDN(str), "0x%02x", v);
        System::uart_ui.nputs(ARRANDN(str));
    }

    // --- Bit 7: SCD (Short Circuit in Discharge) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Short Circuit in Discharge (SCD) fault? "));
    if((v & BV(7)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

    // --- Bit 6: OCD2 (Overcurrent in Discharge 2nd Tier) ---
    System::uart_ui.nputs(ARRANDN(NEWLINE CLIRESET"Overcurrent in Discharge 2nd Tier (OCD2) fault? "));
    if((v & BV(6)))    System::uart_ui.nputs(ARRANDN(CLIYES "triggered"));
    else               System::uart_ui.nputs(ARRANDN(CLINO "none"));

